skltp-ei-backend/src/test/resources/FindContent.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:riv:itintegration:registry:1" xmlns:urn1="urn:riv:itintegration:engagementindex:FindContentResponder:1">
   <soapenv:Header>
      <urn:LogicalAddress>ei-hsa-id</urn:LogicalAddress>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:FindContent>
          <urn1:registeredResidentIdentification>191212121212</urn1:registeredResidentIdentification>
          <urn1:serviceDomain>TEST-DOMAIN</urn1:serviceDomain>
      </urn1:FindContent>
   </soapenv:Body>
</soapenv:Envelope>